var p_proz;
function popup_kak_rabotiat()
{
//Правим прозореца

p_proz = window.open("", "", "top=250, left=620, width=600, height=800");

//HTML в прозореца
//p_proz.document.open();

//HTML съдържание
p_proz.document.write("<html>");
p_proz.document.write("<head><title>Как работят?</title></head>");
p_proz.document.write("<center><font size=5 color=green><i><u>Как работят?</u></i></font></center><br>");

p_proz.document.write("<p style=text-indent:1cm;text-align:Justify;><font size=4>Eлектрическите автомобили функционират чрез електрически мотор, захранван от акумулаторни батерии, които съхраняват електрическа енергия за задвижване на колелата. </font></p>");

p_proz.document.write("<p style=text-indent:1cm;text-align:Justify;><font size=4>Когато шофьорът натисне педала на газта, сигналът се изпраща до контролера, който регулира потока на електричество от батерията към електрическия мотор, който преобразува електрическата енергия в механична, за да задвижи автомобила. Този процес е известен като електромеханично преобразуване и позволява мигновено ускорение, тъй като електрическият мотор развива пълен въртящ момент още от нулеви обороти.</font> </p>");
p_proz.document.write("<p style=text-indent:1cm;text-align:Justify;><font size=4> Ключови компоненти: Електрическите автомобили се състоят от батерия, електрически мотор, силова електроника и система за зареждане. Батерията съхранява електрическа енергия, а електрическият мотор преобразува тази енергия в механична за задвижване на колелата. Силовата електроника контролира потока на електричество между батерията и мотора. </font></p>");
p_proz.document.write("<p style=text-indent:1cm;text-align:Justify;><font size=4>Регенеративно спиране: Електрическият мотор може да служи и за дозареждане на батерията при движение по инерция или при спиране, като превръща кинетичната енергия в електрическа и я връща към батерията.Това удължава пробега и намалява износването на спирачните системи.</font></p>");
p_proz.document.write("<p style=text-indent:1cm;text-align:Justify;><font size=4>Зареждане: Автомобилите се зареждат от външни източници чрез домашни или обществени зарядни станции, като зареждането от обикновен контакт отнема от 4 до 8 часа, а бързите станции могат да заредят до 70% за 20-30 минути.</font></p>");

p_proz.document.write("<p style=text-indent:1cm;text-align:Justify;><font size=4> Поддръжка и ефективност: Електромобилите имат по-ниски разходи за енергия (около 2-3 лв на 100 км) и по-лесна поддръжка, тъй като нямат нужда от смяна на масло, филтри или ремъци. Освен това са по-екологични, произвеждайки нулеви емисии от ауспуха.</font></p>");

 
 

p_proz.document.write("</html>");
//HTML прозорец затваряне

}





